[
  {
    "education": [
      {
        "date": "2014 - 2019",
        "title": "BACHELOR'S DEGREE IN CIVIL ENGINEER - PONTIFICAL JAVERIANA UNIVERSITY",
        "description": "The programme combines scientific and technological knowledge with a focus on sustainability and social responsibility. Skills development in areas such as structures, geotechnics, hydraulics, roads and transport, and construction, with a strong practical component and use of advanced technologies.",
        "link": ""
      },
      {
        "date": "2022 - 2024",
        "title": "Japanese language Diploma - ISI International Study Institute",
        "description": "Two-year program in which Japanese language study was carried out up to a JLPT N1 level. With knowledge of more than 2100 Kanjis and Japanese grammar.",
        "link": "https://drive.google.com/drive/folders/1UHQ81fVH2wvSYhPevnE-6NDzVF0Jl0Bd"
      }
    ]
  },
  {
    "workExperience": [
      {
        "date": "November - 2024",
        "title": "Hackathon Talento Tech - Cali City Hall DATIC",
        "description": "Participation in the development of an MVP (Minimum Viable Product) to address the problem of air quality in the city, using the ICA index as the main indicator. Application development with technologies such as React JS, TypeScript and TailwindCSS. Implementation of API consumption to integrate interactive maps and JSON design to structure information. Creation of intuitive interfaces and components to improve the user experience.",
        "link": "https://proyecto-alcaldia-cali.vercel.app/",
        "link2": "https://drive.google.com/drive/u/0/folders/1UHQ81fVH2wvSYhPevnE-6NDzVF0Jl0Bd"
      },
      {
        "date": "April - 2024",
        "title": "Skyscanner Front-End Software Engineering virtual experience programme on Forage",
        "description": "In this activity, I performed a job simulation assuming the role of a front-end engineer at Skyscanner, where I built a web application using React. During the process, I developed a specific page to allow users to choose a travel date. To do this, I used the open source Backpack React library, created by Skyscanner, which makes it easy to develop coherent and attractive user interfaces. In addition to implementing this functionality, I customized the application according to the established requirements and ran automated tests to ensure that everything was processed correctly and met quality standards.",
        "link": "https://www.linkedin.com/in/jclosadab/details/certifications/1714190095609/single-media-viewer/?profileId=ACoAACjO1LgBP3kOvqhPwEySPixBjS41Xth3OWs"
      }
    ]
  },
  {
    "professionalCourses": [
      {
        "date": "09/2024 - Continue",
        "title": "FullStack Web Developer - Tech Talent Program Colombia [Cymetria & Tecnalia Colombia]",
        "description": "FullStack Web Development course with an intensive training experience spanning over 159 hours of specialized content. During this course, I have consolidated my knowledge in key technologies of FullStack Web Development, including HTML, CSS, JavaScript, React, NodeJS, Express, TailwindCSS & GIT, as well as agile methodologies and good programming practices.",
        "link": "https://drive.google.com/drive/u/0/folders/1UHQ81fVH2wvSYhPevnE-6NDzVF0Jl0Bd"
      },
      {
        "date": "03/2023 - 10/2023",
        "title": "Oracle Next Education F2 T5 Front-end Program",
        "description": "Course aimed at the Frontend with an intensive training experience that covered more than 330 hours of specialized content. During this course, I have consolidated my knowledge in key Front-end development technologies, including HTML, CSS, JAvaScript, React and GIT, as well as agile methodologies and good programming practices.",
        "link": "https://app.aluracursos.com/user/juancamilo-lb/fullCertificate/31f0b523b39f8728435999254fdf0439"
      },
      {
        "date": "10/2021 - Continue",
        "title": "PDevelopment of web pages, digital/multimedia content and computer resources",
        "description": "Platzi is a leading online education platform specializing in web development and technology courses. Founded in 2014, Platzi has become a go-to resource for people looking to improve their skills or embark on a career in the digital field. With an extensive library of courses covering a wide range of topics, including programming languages, web design, data science, and more, Platzi serves students of all levels, from beginners to seasoned professionals. The platform's interactive and immersive learning environment, along with expert instructors and a supportive community, creates an engaging and effective educational experience.",
        "link": "https://platzi.com/p/jclosdab1996/"
      }
    ]
  }
]
